---
type: SpatialElementGeometryResults
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# SpatialElementGeometryResults

`Autodesk.Revit.DB.SpatialElementGeometryResults` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBoundaryFaceInfo | 2012 | `public IList < SpatialElementBoundarySubface > GetBoundaryFaceInfo ( Face face )` |
| Method | GetGeometry | 2012 | `public Solid GetGeometry ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |